morze = {'а': '.-', 'б': '-...', 'в': '.--', 'г': '--.', 'д': '-..', 'е': '.', 'ё': '.', 'ж': '...-', 'з': '--..', 'и': '..', 'й': '.---', 'к': '-.-', 'л': '.-..', 'м': '--', 'н': '-.', 'о': '---', 'п': '.--.', 'р': '.-.', 'с': '...', 'т': '-', 'у': '..-', 'ф': '..-.', 'х': '....', 'ц': '-.-.', 'ч': '---.', 'ш': '----', 'щ': '--.-', 'ъ': '--.--', 'ы': '-.--', 'ь': '-..-', 'э': '..-..', 'ю': '..--', 'я': '.-.-', ' ': '-...-'}
t = input().lower()

c = ''
for i in t:

    c += morze.get(i)
    c += ' '

print(c)

#--------------------------

print(*[morze.get(i) for i in input().lower()])

#--------------------------
print('@'.join(input().lower()).translate(str.maketrans(morze)))

#-------------------------Из морзе в кириллицу
c = input().split()

e = ''
for i in c:
    for x, y in morze.items():
        if i == y:
            e += x
print(e)

#------------------- Или...

back_morze = {v: k for k, v in morze.items()}#обращаем словарь(значение теперь ключ и наоборот)

print(*(back_morze[code] for code in input().lower().split()), sep='')